tutorials/aneurysm flow/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       47440;
    }
    outlet
    {
        type            patch;
        nFaces          80;
        startFace       47520;
    }
    top
    {
        type            patch;
        nFaces          480;
        startFace       47600;
    }
    bottom
    {
        type            patch;
        nFaces          480;
        startFace       48080;
    }
    frontAndBack
    {
        type            patch;
        nFaces          19200;
        startFace       48560;
    }
)

// ************************************************************************* //
